-- MySQL dump 10.13  Distrib 8.0.23, for Win64 (x86_64)
--
-- Host: localhost    Database: graduateproject
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `t_article`
--

DROP TABLE IF EXISTS `t_article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_article` (
  `article_id` int NOT NULL AUTO_INCREMENT,
  `article_title` varchar(45) DEFAULT NULL,
  `article_content` varchar(45) DEFAULT NULL,
  `article_reply_num` int DEFAULT '0',
  `article_star` int DEFAULT '0',
  `article_reply` varchar(500) DEFAULT NULL,
  `article_user_name` varchar(45) DEFAULT NULL,
  `article_time` varchar(45) DEFAULT NULL,
  `article_click` int DEFAULT '0',
  PRIMARY KEY (`article_id`)
) ENGINE=InnoDB AUTO_INCREMENT=125 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_article`
--

LOCK TABLES `t_article` WRITE;
/*!40000 ALTER TABLE `t_article` DISABLE KEYS */;
INSERT INTO `t_article` VALUES (23,'第一次发帖 很紧张','大家来找我聊天呀',17,3,NULL,'zhu','2022/04/21 23:13:13',51),(24,'第二次发帖  测试热度推荐算法','想学习',2,2,NULL,'zhu','2022/04/21 23:20:50',9),(25,'测试热度算法22','得到的',2,2,NULL,'zhu','2022/04/21 23:21:01',7),(26,'测试热度算法的点点滴滴','465546156468',0,1,NULL,'user','2022/04/21 23:21:25',2),(27,'继续发帖','地对地导弹得多多多',1,1,NULL,'user','2022/04/21 23:21:36',4),(28,'5649哎但是第五大道','打滴滴',1,1,NULL,'user','2022/04/21 23:21:50',4),(29,'这个应该是热帖','得到的',8,1,NULL,'zhu','2022/04/21 23:34:03',8),(32,'xxx ','xxx',0,0,NULL,'user','2022/04/26 23:12:36',3),(33,'想聊天','想聊天',1,0,NULL,'user','2022/05/10 16:00:49',1),(34,'毕业季','祝大家毕业快乐，前程似锦',2,1,NULL,'user','2022/05/15 16:58:00',5),(35,'又来了发帖狂魔','有没推荐的悬疑类小说可以看',0,0,NULL,'user','2022/05/15 17:32:11',1),(36,'三体有喜欢的吗','三体给我的震撼真的很大，有喜欢三体的吗？来大家交流一下想法呀？欢迎新人发问哦？',6,0,NULL,'user','2022/05/15 17:33:41',21),(37,'Javaweb怎样学习？','有人知道Javaweb如何能够系统的学习吗，感觉自己还是不会入门呢',0,0,NULL,'user','2022/05/15 17:35:42',1),(38,'php学习交流','有对php感兴趣的吗。想要找个大神交流一下？',0,0,NULL,'user','2022/05/15 17:36:30',0),(39,'java开发工程师','公司的java开发太厉害了吧，想要学习一下',5,1,NULL,'user','2022/05/15 17:37:06',3),(40,'前端开发工程师','想要转行做前端开发，有推荐的课程吗？谢谢',1,1,NULL,'user','2022/05/15 17:37:41',3),(41,'测试工程师','测试工程师需要掌握什么技术呢，需要花很长时间去学习吗?',0,2,NULL,'user','2022/05/15 17:38:19',0),(42,'产品岗位','听说产品很难做，很卷是不是呀？怎样培养产品思维呢？',0,2,NULL,'user','2022/05/15 17:38:57',0),(43,'产品思维的养成','作为产品岗位，最重要的是培养产品思维、用户思维。',1,2,NULL,'user','2022/05/15 17:40:05',2),(44,'王小波—沉默的大多数','看了王小波的书籍，感触很多，他的文字是真的很犀利，给人感触很大。',0,2,NULL,'user','2022/05/15 17:41:09',1),(45,'沉默的大多数','里面有一篇讲的是现在很流行的做一只特立独行的猪',0,1,NULL,'user','2022/05/15 17:41:53',0),(46,'做一只特立独行的猪','王小波讲到他做知青下放到乡村时遇到一只奇怪的猪。',0,2,NULL,'user','2022/05/15 17:42:58',0),(47,'窗边的小豆豆','窗边的小豆豆是一本很适合青少年的读物',0,1,NULL,'user','2022/05/15 17:44:29',0),(48,'小豆豆有人知道吗','在小学爸爸几乎每个月都要带我和我的姐姐去买书，这是我在小学看过的窗边的小豆豆里面的主人翁',0,0,NULL,'user','2022/05/15 17:45:43',0),(49,'c++学习推荐','如何学习c++呢？',0,0,NULL,'user','2022/05/15 17:47:12',2),(50,'c++入门','想要学习c++吗，快来和我一起把',0,0,NULL,'user','2022/05/15 17:47:42',0),(51,'平凡之路','有人知道平凡之路这本书吗？推荐阅读吗',0,2,NULL,'user','2022/05/15 17:48:33',0),(52,'社区图书馆的开门时间','图书馆最早开门时间是多久呀？',0,2,NULL,'user','2022/05/15 17:49:08',1),(53,'图书馆能不能帮别人占座位呀？','想知道能不能帮朋友预约座位呀',1,1,NULL,'user','2022/05/15 17:49:48',1),(54,'求小学生适合看的书籍推荐','有么有家中有小孩子的，一般大家都看什么书籍呢',0,2,NULL,'user','2022/05/15 17:50:39',1),(55,'初中学生书籍推荐','有哪些书籍是初中学生适合看的呀',0,1,NULL,'user','2022/05/15 17:51:09',1),(56,'家里面的孩子很喜欢看小说该制止吗','孩子喜欢看小说，每天回家都是拿着小说看，我应该制止吗？',0,0,NULL,'user','2022/05/15 17:52:13',0),(57,'如何教孩子独立','有这方面的书籍推荐吗',0,0,NULL,'user','2022/05/15 17:52:38',0),(58,'如何让孩子知道学习的重要性','小孩子总是觉得学习是为了家长，怎样让他们认识到这是为了他们的人生',0,1,NULL,'user','2022/05/15 17:53:23',0),(59,'女孩子必读的五本书推荐','最近想要多读一点书籍，有合适的推荐嘛',1,1,NULL,'user','2022/05/15 17:53:53',1),(60,'书籍交换','有想要和我交换阅读书籍的吗，我有悬疑类、科幻类的比较多哟',1,1,NULL,'user','2022/05/15 17:54:37',1),(61,'数据结构','数据结构也太难了吧',0,1,NULL,'user','2022/05/15 17:55:02',0),(62,'数据结构实验报告','这个实验报告怎么写呀，做不来实验呀',0,1,NULL,'user','2022/05/15 17:55:41',0),(63,'答辩的注意事项','从来没答辩过，有人知道一些注意事项吗',0,1,NULL,'user','2022/05/15 17:56:13',1),(64,'论文的格式','社区的的朋友们，有写论文的不，一起交流一下呀',1,1,NULL,'user','2022/05/15 17:56:57',1),(65,'论文的注意事项','论文太多注意事项了，你知道哪些呢',0,1,NULL,'user','2022/05/15 17:57:20',0),(66,'三体经典台词','还记得三体的经典台词吗？',0,1,NULL,'user','2022/05/15 17:57:54',2),(67,'英文单词的记忆方法','如何有效的记忆英文单词。这些点你应该注意',0,1,NULL,'user','2022/05/15 17:58:26',0),(68,'数据字典','给开发写数据字段的表需要注意哪些呢',0,1,NULL,'user','2022/05/15 17:58:51',0),(69,'如何有效的与他人沟通','最近想要学习一下沟通的艺术，有推荐的书籍吗',0,1,NULL,'user','2022/05/15 17:59:24',1),(70,'沟通的艺术','我一直认为沟通是一门艺术，你知道有哪些吗？',1,1,NULL,'user','2022/05/15 17:59:50',1),(71,'机器学习','有了解机器学习吗，交流一下',0,1,NULL,'zhu','2022/05/15 18:09:18',0),(72,'最近对机器学习感兴趣','有想要交流的吗？欢迎提问',0,0,NULL,'zhu','2022/05/15 18:09:45',1),(73,'周末图书馆人多吗','想要去图书馆自习',0,0,NULL,'zhu','2022/05/15 18:10:10',3),(74,'你最近看的什么书','推荐一下',0,0,NULL,'zhu','2022/05/15 18:21:18',2),(75,'论文查重','有哪些免费的查重软件？',0,0,NULL,'zhu','2022/05/15 18:23:27',1),(76,'你知道自己的专长吗','一本书告诉你自己都不知道的一面？',0,1,NULL,'zhu','2022/05/15 18:24:29',2),(77,'本周推荐的书籍太好看了吧','有人看了吗',0,0,NULL,'zhu','2022/05/15 18:25:01',0),(78,'你最近有特别喜欢的书籍吗','求推荐书籍',0,1,NULL,'zhu','2022/05/15 18:36:07',3),(79,'你喜欢的编程习惯','你知道自己的潜在习惯吗。快打开电脑看一看吧',0,1,NULL,'zhu','2022/05/15 18:37:08',0),(80,'简爱','有看过简爱的吗，求大家的书籍评论',0,0,NULL,'zhu','2022/05/15 18:37:37',0),(81,'简爱的电影','看了书籍之后去看了简爱的电影，太好看了吧',0,0,NULL,'zhu','2022/05/15 18:38:09',1),(82,'简爱电影的女主角','简爱电影的女猪好好看呀，男主也是',0,0,NULL,'zhu','2022/05/15 18:39:00',0),(83,'相似类容推荐算法的实现','最近在看相似内容推荐算法，最重要的就是计算相似度',0,0,NULL,'zhu','2022/05/15 18:40:25',0),(84,'相似内容推荐相似度的计算','先运用jieba分词，在合并关键词，然后计算向量，最后计算相似度',0,0,NULL,'zhu','2022/05/15 18:41:33',0),(85,'热度推荐算法的实现','最近在看热度推荐算法，并且进行了相对的改动',1,1,NULL,'zhu','2022/05/15 18:43:48',1),(86,'如何对热度推荐算法进行改动','改动主要是为了更好的记录用户的行为，比如改动w\\i\\t',0,1,NULL,'zhu','2022/05/15 18:44:53',0),(87,'老爸老妈浪漫史','老爸老妈浪漫史中的barney有出书哦',0,1,NULL,'zhu','2022/05/15 18:45:49',0),(88,'barney','老爸老妈浪漫史中的书籍太好看了',0,0,NULL,'zhu','2022/05/15 18:46:13',0),(89,'老友记','老友记有书籍吗',0,0,NULL,'zhu','2022/05/15 18:46:28',2),(90,'老友记与老爸老妈中人物有重合','有相同的女主吗',0,0,NULL,'zhu','2022/05/15 18:47:12',0),(91,'如何沉浸式读书','发现自己阅读的时候总是不能集中注意力，有什么好办法吗？',0,0,NULL,'zhu','2022/05/16 09:55:16',0),(92,'集中注意力的方法','想要集中注意力，环境也很重要',0,0,NULL,'zhu','2022/05/16 09:55:38',0),(93,'高中是否应该集中注意力读书','自己喜欢看书，但是对课本不感兴趣怎么办',0,0,NULL,'zhu','2022/05/16 09:56:37',0),(94,'生物细胞学','生物细胞学有了解的吗？',0,1,NULL,'zhu','2022/05/16 09:57:30',0),(95,'想知道大家在家会自主阅读吗？','周末在家会自主阅读吗，我发现自己一个人在家只想摆烂',0,0,NULL,'zhu','2022/05/16 09:58:59',0),(96,'图书馆附近','这附近有什么好喝的咖啡店吗',0,1,NULL,'zhu','2022/05/16 09:59:30',0),(97,'咖啡店推荐','有喜欢喝咖啡的吗？社区附近咖啡店推荐一下呀',0,0,NULL,'zhu','2022/05/16 09:59:58',1),(98,'咖啡爱好者','真的是里了咖啡不行呀，每天都想要喝咖啡',0,1,NULL,'zhu','2022/05/16 10:00:29',0),(99,'咖啡豆的烘焙','有会烘咖啡豆的吗，交流一下心得呀',1,1,NULL,'zhu','2022/05/16 10:01:01',1),(101,'发帖指南','听说这个图书馆系统发帖用语很规范',0,1,NULL,'zhu','2022/05/16 10:01:41',0),(102,'图书馆系统','终于可以线上借书了太棒了吧',0,1,NULL,'zhu','2022/05/16 10:02:08',0),(103,'线上预约','线上真的会方便很多，之前去图书馆发现没有座位了',0,1,NULL,'zhu','2022/05/16 10:02:44',0),(104,'线上借书','可以线上借书真的是很棒了',0,0,NULL,'zhu','2022/05/16 10:03:09',2),(105,'疫情','现在疫情好严重呀，图书馆还能进吗',0,0,NULL,'zhu','2022/05/16 10:03:31',2),(106,'社区图书馆疫情防控','现在是只有绿码能进去吗',0,0,NULL,'zhu','2022/05/16 10:03:58',0),(107,'假期书籍推荐','两个月的假期应该怎么度过呀，有什么书籍推荐吗？',0,0,NULL,'zhu','2022/05/16 10:18:43',0),(108,'三体','好多人喜欢三体呀，太好了吧',0,0,NULL,'user1','2022/05/16 10:21:14',0),(109,'儿童读物','有什么儿童读物推荐的吗',0,0,NULL,'user1','2022/05/16 10:25:20',0),(110,'儿童书籍推荐','三四岁的孩子大多数看的是什么书呀',0,0,NULL,'user1','2022/05/16 10:25:53',0),(111,'记忆比较深刻的书籍','你至今为止记忆比较深刻的书籍是什么呀',0,0,NULL,'user1','2022/05/16 10:26:55',0),(112,'哲学','有什么哲学相关的书籍推荐吗？\n',0,0,NULL,'user1','2022/05/16 10:27:31',1),(113,'物理学','图书馆物理学的书籍多吗',0,0,NULL,'user1','2022/05/16 10:27:50',0),(114,'社区爱书人士交流','想要组织一个线下的读书交流有想要来的吗?',0,0,NULL,'user1','2022/05/16 10:28:45',2),(115,'悬疑类小说推荐','喜欢看悬疑类小说的推荐一下呀',0,0,NULL,'user1','2022/05/16 10:33:35',1),(116,'推荐','最近书荒了，求推荐',0,0,NULL,'user1','2022/05/16 10:35:07',0),(121,'懂的都懂','啊啊啊',0,0,NULL,'user','2022/05/16 11:43:56',0),(122,'帖子发布','你好',0,0,NULL,'user','2022/05/26 22:35:50',0),(123,'发布帖子','你好，图书馆。',0,0,NULL,'user','2022/05/26 22:44:45',0),(124,'发布最新的帖子','你好呀',0,0,NULL,'user','2022/05/26 22:47:50',0);
/*!40000 ALTER TABLE `t_article` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-10-08 19:10:05
